test_soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pos="http://disim.univaq.it/services/postingservice">
   <soapenv:Header/>
   <soapenv:Body>
      <pos:availabilityRequest>
         <pos:applicant>
            <pos:name>Mario</pos:name>
            <pos:surname>Rossi</pos:surname>
            <pos:taxCode>RSSMRA90A01E897Z</pos:taxCode>
            <pos:address>Viale Gran Sasso 1</pos:address>
            <pos:city>L'Aquila</pos:city>
            <pos:zip>67100</pos:zip>
            <pos:email>mariorossi@email.it</pos:email>
         </pos:applicant>
         <pos:posting>
            <pos:posterFormat>60x80</pos:posterFormat>
            <pos:zone>
               <pos:id>5</pos:id>
               <pos:city>Rome</pos:city>
            </pos:zone>
            <pos:zone>
               <pos:id>7</pos:id>
               <pos:city>Rome</pos:city>
            </pos:zone>
            <pos:zone>
               <pos:id>8</pos:id>
               <pos:city>Rome</pos:city>
            </pos:zone>
            <pos:zone>
               <pos:id>9</pos:id>
               <pos:city>Rome</pos:city>
            </pos:zone>
            <pos:zone>
               <pos:id>10</pos:id>
               <pos:city>Rome</pos:city>
            </pos:zone>
         </pos:posting>
      </pos:availabilityRequest>
   </soapenv:Body>
</soapenv:Envelope>
